{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_23", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8192, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "conv1d_14126", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14126", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13519", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13519", "inbound_nodes": [[["conv1d_14126", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14127", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14127", "inbound_nodes": [[["re_lu_13519", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13520", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13520", "inbound_nodes": [[["conv1d_14127", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14128", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14128", "inbound_nodes": [[["re_lu_13520", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13521", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13521", "inbound_nodes": [[["conv1d_14128", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14129", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14129", "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3803", "trainable": true, "dtype": "float32"}, "name": "add_3803", "inbound_nodes": [[["re_lu_13521", 0, 0, {}], ["conv1d_14129", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13522", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13522", "inbound_nodes": [[["add_3803", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14130", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14130", "inbound_nodes": [[["re_lu_13522", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13523", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13523", "inbound_nodes": [[["conv1d_14130", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14131", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14131", "inbound_nodes": [[["re_lu_13523", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13524", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13524", "inbound_nodes": [[["conv1d_14131", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14132", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14132", "inbound_nodes": [[["re_lu_13524", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13525", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13525", "inbound_nodes": [[["conv1d_14132", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14133", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14133", "inbound_nodes": [[["re_lu_13522", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3804", "trainable": true, "dtype": "float32"}, "name": "add_3804", "inbound_nodes": [[["re_lu_13525", 0, 0, {}], ["conv1d_14133", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13526", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13526", "inbound_nodes": [[["add_3804", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14134", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14134", "inbound_nodes": [[["re_lu_13526", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13527", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13527", "inbound_nodes": [[["conv1d_14134", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14135", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14135", "inbound_nodes": [[["re_lu_13527", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13528", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13528", "inbound_nodes": [[["conv1d_14135", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14136", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14136", "inbound_nodes": [[["re_lu_13528", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13529", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13529", "inbound_nodes": [[["conv1d_14136", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14137", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14137", "inbound_nodes": [[["re_lu_13526", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3805", "trainable": true, "dtype": "float32"}, "name": "add_3805", "inbound_nodes": [[["re_lu_13529", 0, 0, {}], ["conv1d_14137", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13530", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13530", "inbound_nodes": [[["add_3805", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14138", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14138", "inbound_nodes": [[["re_lu_13530", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13531", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13531", "inbound_nodes": [[["conv1d_14138", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14139", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14139", "inbound_nodes": [[["re_lu_13531", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13532", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13532", "inbound_nodes": [[["conv1d_14139", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14140", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14140", "inbound_nodes": [[["re_lu_13532", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3806", "trainable": true, "dtype": "float32"}, "name": "add_3806", "inbound_nodes": [[["conv1d_14140", 0, 0, {}], ["re_lu_13530", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13533", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13533", "inbound_nodes": [[["add_3806", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14141", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14141", "inbound_nodes": [[["re_lu_13533", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13534", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13534", "inbound_nodes": [[["conv1d_14141", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14142", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14142", "inbound_nodes": [[["re_lu_13534", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13535", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13535", "inbound_nodes": [[["conv1d_14142", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14143", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14143", "inbound_nodes": [[["re_lu_13535", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13536", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13536", "inbound_nodes": [[["conv1d_14143", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14144", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14144", "inbound_nodes": [[["re_lu_13533", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3807", "trainable": true, "dtype": "float32"}, "name": "add_3807", "inbound_nodes": [[["re_lu_13536", 0, 0, {}], ["conv1d_14144", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13537", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13537", "inbound_nodes": [[["add_3807", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14145", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14145", "inbound_nodes": [[["re_lu_13537", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13538", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13538", "inbound_nodes": [[["conv1d_14145", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14146", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14146", "inbound_nodes": [[["re_lu_13538", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13539", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13539", "inbound_nodes": [[["conv1d_14146", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14147", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14147", "inbound_nodes": [[["re_lu_13539", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3808", "trainable": true, "dtype": "float32"}, "name": "add_3808", "inbound_nodes": [[["conv1d_14147", 0, 0, {}], ["re_lu_13537", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13540", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13540", "inbound_nodes": [[["add_3808", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14148", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14148", "inbound_nodes": [[["re_lu_13540", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13541", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13541", "inbound_nodes": [[["conv1d_14148", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14149", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14149", "inbound_nodes": [[["re_lu_13541", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13542", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13542", "inbound_nodes": [[["conv1d_14149", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14150", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14150", "inbound_nodes": [[["re_lu_13542", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13543", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13543", "inbound_nodes": [[["conv1d_14150", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14151", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14151", "inbound_nodes": [[["re_lu_13540", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3809", "trainable": true, "dtype": "float32"}, "name": "add_3809", "inbound_nodes": [[["re_lu_13543", 0, 0, {}], ["conv1d_14151", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13544", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13544", "inbound_nodes": [[["add_3809", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14152", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14152", "inbound_nodes": [[["re_lu_13544", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13545", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13545", "inbound_nodes": [[["conv1d_14152", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14153", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14153", "inbound_nodes": [[["re_lu_13545", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13546", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13546", "inbound_nodes": [[["conv1d_14153", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14154", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14154", "inbound_nodes": [[["re_lu_13546", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3810", "trainable": true, "dtype": "float32"}, "name": "add_3810", "inbound_nodes": [[["conv1d_14154", 0, 0, {}], ["re_lu_13544", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13547", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13547", "inbound_nodes": [[["add_3810", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14155", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14155", "inbound_nodes": [[["re_lu_13547", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13548", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13548", "inbound_nodes": [[["conv1d_14155", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14156", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14156", "inbound_nodes": [[["re_lu_13548", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13549", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13549", "inbound_nodes": [[["conv1d_14156", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14157", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14157", "inbound_nodes": [[["re_lu_13549", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3811", "trainable": true, "dtype": "float32"}, "name": "add_3811", "inbound_nodes": [[["conv1d_14157", 0, 0, {}], ["re_lu_13547", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13550", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13550", "inbound_nodes": [[["add_3811", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14158", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14158", "inbound_nodes": [[["re_lu_13550", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13551", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13551", "inbound_nodes": [[["conv1d_14158", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14159", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14159", "inbound_nodes": [[["re_lu_13551", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13552", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13552", "inbound_nodes": [[["conv1d_14159", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14160", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14160", "inbound_nodes": [[["re_lu_13552", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3812", "trainable": true, "dtype": "float32"}, "name": "add_3812", "inbound_nodes": [[["conv1d_14160", 0, 0, {}], ["re_lu_13550", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13553", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13553", "inbound_nodes": [[["add_3812", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14161", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14161", "inbound_nodes": [[["re_lu_13553", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13554", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13554", "inbound_nodes": [[["conv1d_14161", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14162", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14162", "inbound_nodes": [[["re_lu_13554", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13555", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13555", "inbound_nodes": [[["conv1d_14162", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14163", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14163", "inbound_nodes": [[["re_lu_13555", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3813", "trainable": true, "dtype": "float32"}, "name": "add_3813", "inbound_nodes": [[["conv1d_14163", 0, 0, {}], ["re_lu_13553", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13556", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13556", "inbound_nodes": [[["add_3813", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14164", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14164", "inbound_nodes": [[["re_lu_13556", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13557", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13557", "inbound_nodes": [[["conv1d_14164", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14165", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14165", "inbound_nodes": [[["re_lu_13557", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13558", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13558", "inbound_nodes": [[["conv1d_14165", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14166", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14166", "inbound_nodes": [[["re_lu_13558", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13559", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13559", "inbound_nodes": [[["conv1d_14166", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14167", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14167", "inbound_nodes": [[["re_lu_13556", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3814", "trainable": true, "dtype": "float32"}, "name": "add_3814", "inbound_nodes": [[["re_lu_13559", 0, 0, {}], ["conv1d_14167", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13560", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13560", "inbound_nodes": [[["add_3814", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14168", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14168", "inbound_nodes": [[["re_lu_13560", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13561", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13561", "inbound_nodes": [[["conv1d_14168", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14169", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14169", "inbound_nodes": [[["re_lu_13561", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13562", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13562", "inbound_nodes": [[["conv1d_14169", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14170", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14170", "inbound_nodes": [[["re_lu_13562", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3815", "trainable": true, "dtype": "float32"}, "name": "add_3815", "inbound_nodes": [[["conv1d_14170", 0, 0, {}], ["re_lu_13560", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13563", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13563", "inbound_nodes": [[["add_3815", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14171", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14171", "inbound_nodes": [[["re_lu_13563", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13564", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13564", "inbound_nodes": [[["conv1d_14171", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14172", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14172", "inbound_nodes": [[["re_lu_13564", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13565", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13565", "inbound_nodes": [[["conv1d_14172", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14173", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14173", "inbound_nodes": [[["re_lu_13565", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3816", "trainable": true, "dtype": "float32"}, "name": "add_3816", "inbound_nodes": [[["conv1d_14173", 0, 0, {}], ["re_lu_13563", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13566", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13566", "inbound_nodes": [[["add_3816", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14174", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14174", "inbound_nodes": [[["re_lu_13566", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13567", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13567", "inbound_nodes": [[["conv1d_14174", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14175", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14175", "inbound_nodes": [[["re_lu_13567", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13568", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13568", "inbound_nodes": [[["conv1d_14175", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14176", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14176", "inbound_nodes": [[["re_lu_13568", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3817", "trainable": true, "dtype": "float32"}, "name": "add_3817", "inbound_nodes": [[["conv1d_14176", 0, 0, {}], ["re_lu_13566", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13569", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13569", "inbound_nodes": [[["add_3817", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14177", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14177", "inbound_nodes": [[["re_lu_13569", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13570", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13570", "inbound_nodes": [[["conv1d_14177", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14178", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14178", "inbound_nodes": [[["re_lu_13570", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13571", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13571", "inbound_nodes": [[["conv1d_14178", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14179", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_14179", "inbound_nodes": [[["re_lu_13571", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3818", "trainable": true, "dtype": "float32"}, "name": "add_3818", "inbound_nodes": [[["conv1d_14179", 0, 0, {}], ["re_lu_13569", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13572", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13572", "inbound_nodes": [[["add_3818", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_14180", "trainable": true, "dtype": "float32", "filters": 44, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1,